// Задача 1.4.1

// Выведите в консоль все целые числа от 1 до 100.

for (let i = 1; i < 101; i++) {
    // console.log(i)
}

// Задача 1.4.2

/*
Выведите в консоль все целые числа от -100 до 0.
*/
for (let i = 0; i > -101; i--) {
    // console.log(i)
}

// Задача 1.4.3

// Выведите в консоль все целые числа от 100 до 1.

for (let i = 100; i > 0; i--) {
    // console.log(i)
}

// Задача 1.4.4

// Выведите в консоль все четные числа из промежутка от 1 до 100.

for (let i = 2; i <= 100; i += 2) {
        // console.log(i)
}


// Задача 1.4.5

// Выведите в консоль все числа кратные трем в промежутке от 1 до 100.

for (let i = 3; i <= 100; i += 3) {
    // console.log(i)
}



